In [5]:
import pandas as pd
import numpy as np

obj1 = {
    "student_id": ['s1', 's2', 's3', 's4', 's5', 's6'],
    "stat_score": [55, 90, 85, 71, 63, 99],
    "math_score": [65, 99, 87, 75, 57, 88],
    "sex": ["Female", "Male", "Female", "Female", "Male", "Male"],
    "pre_level": ["B", "A", "B", "B", "C", "A"]
}

df = pd.DataFrame(obj1)
df

  student_id  stat_score  math_score     sex pre_level
0         s1          55          65  Female         B
1         s2          90          99    Male         A
2         s3          85          87  Female         B
3         s4          71          75  Female         B
4         s5          63          57    Male         C
5         s6          99          88    Male         A

In [6]:
df.groupby("sex")[["math_score"]].mean()

        math_score
sex
Female   75.666667
Male     81.333333

In [7]:
df.groupby("sex", as_index=False)[["math_score"]].mean()

      sex  math_score
0  Female   75.666667
1    Male   81.333333

In [8]:
df.groupby("sex", as_index=False).describe()

      sex score                                                      \
          count       mean        std   min   25%   50%   75%   max
0  Female   3.0  70.333333  15.011107  55.0  63.0  71.0  78.0  85.0
1    Male   3.0  84.000000  18.734994  63.0  76.5  90.0  94.5  99.0

  math_score
       count       mean        std   min   25%   50%   75%   max
0        3.0  75.666667  11.015141  65.0  70.0  75.0  81.0  87.0
1        3.0  81.333333  21.779195  57.0  72.5  88.0  93.5  99.0

In [7]:
df.groupby("sex")[["stat_score", "math_score"]].agg(["mean", "sum"])

       stat_score      math_score
             mean  sum       mean  sum
sex
Female  70.333333  211  75.666667  227
Male    84.000000  252  81.333333  244

In [14]:
df.groupby("sex")[["stat_score", "math_score"]].agg({"stat_score": "mean", "math_score": "sum"})

        stat_score  math_score
sex
Female   70.333333         227
Male     84.000000         244

In [15]:
df.groupby("sex")[["stat_score", "math_score"]].agg({"stat_score": [np.mean, np.median], "math_score": [sum, max]})

C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10224\3594506503.py:1: FutureWarning: The provided callable <function mean at 0x000001E794942480> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.groupby("sex")[["stat_score", "math_score"]].agg({"stat_score": [np.mean, np.median], "math_score": [sum, max]})
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10224\3594506503.py:1: FutureWarning: The provided callable <function median at 0x000001E794A94AE0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("sex")[["stat_score", "math_score"]].agg({"stat_score": [np.mean, np.median], "math_score": [sum, max]})
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10224\3594506503.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby("sex")[["stat_score", "math_score"]].agg({"stat_score": [np.mean, np.median], "math_score": [sum, max]})
C:\Users\as4761285 001\AppData\Local\Temp\ipykernel_10224\3594506503.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("sex")[["stat_score", "math_score"]].agg({"stat_score": [np.mean, np.median], "math_score": [sum, max]})

       stat_score        math_score
             mean median        sum max
sex
Female  70.333333   71.0        227  87
Male    84.000000   90.0        244  99

In [17]:
df.groupby("sex", as_index=False)[["stat_score", "math_score"]].agg({"stat_score": ["mean", "median"], "math_score": ["sum", "max"]})

      sex stat_score        math_score
                mean median        sum max
0  Female  70.333333   71.0        227  87
1    Male  84.000000   90.0        244  99

In [18]:
obj1 = {
    "student_id": ['s1', 's2', 's3', 's4', 's5', 's6'],
    "stat_score": [55, 90, 85, 71, 63, 99],
    "math_score": [65, 99, 87, 75, 57, 88],
    "sex": ["Female", "Male", "Female", "Female", "Male", "Male"],
    "pre_level": ["B", "A", "B", "B", "C", "A"]
}

In [19]:
df["pre_level"].map({"A": 0, "B": 1, "C": 2})

0    1
1    0
2    1
3    1
4    2
5    0
Name: pre_level, dtype: int64

In [20]:
df["pre_level"]

0    B
1    A
2    B
3    B
4    C
5    A
Name: pre_level, dtype: object

In [21]:
def f(x):
    return (x**2) + (2*x) - 5000

df["stat_score"]

0    55
1    90
2    85
3    71
4    63
5    99
Name: stat_score, dtype: int64

In [22]:
df["stat_score"].map(f)

0   -1865
1    3280
2    2395
3     183
4    -905
5    4999
Name: stat_score, dtype: int64

In [24]:
df[["stat_score", "math_score"]].apply("sum") #세로 합

stat_score    463
math_score    471
dtype: int64

In [25]:
df[["stat_score", "math_score"]].apply("sum", axis=1) #가로 합

0    120
1    189
2    172
3    146
4    120
5    187
dtype: int64

In [26]:
df[["stat_score", "math_score"]].sum(axis=1)

0    120
1    189
2    172
3    146
4    120
5    187
dtype: int64